<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9c3867846edd661cd7b4b059262ecebe3dd44b6461f60516deccec6f7098614e","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1338 at https://github.com/cal-itp/data-infra/actions/runs/20941140061","plan_out_hash":"821cbb013c1fd305a399972f5cff423e2b683cbe4d83763c08372f1aa7ddac25","plan_hash":"9cf83ab3b8c83bbfd88554a73b85c9284993a0a6e3ba38ca29dce31e436b06f3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "T/QO7Q==" -> (known after apply)
!~      detect_md5hash      = "CmhUy7xIqmzufuxcCXV1yg==" -> "different hash"
!~      generation          = 1767986257222525 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "CmhUy7xIqmzufuxcCXV1yg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/incremental_where.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "IgJD3Q==" -> (known after apply)
!~      detect_md5hash      = "k6BxXYmdWDTk/x+0KxH2vA==" -> "different hash"
!~      generation          = 1751416667360676 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/incremental_where.sql"
!~      md5hash             = "k6BxXYmdWDTk/x+0KxH2vA==" -> (known after apply)
        name                = "data/warehouse/macros/incremental_where.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Hnb9/g==" -> (known after apply)
!~      detect_md5hash      = "o51gEzjpdSI4kBOeprhY4g==" -> "different hash"
!~      generation          = 1767986258659920 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "o51gEzjpdSI4kBOeprhY4g==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1338](https://github.com/cal-itp/data-infra/actions/runs/20941140061)